{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"cat_serviceCategory": {"name": "cat_servicecategory:0", "dtype": "DT_INT8", "tensorShape": {"dim": [{"size": "-1"}]}}, "desc_len:0": {"name": "desc_len:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}, "lat:0": {"name": "lat:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1251}, "lng:0": {"name": "lng:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "addr_len:0": {"name": "addr_len:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "addr_len", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "cat_servicecategory", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT8"}}}, {"name": "desc_len", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_INT64"}}}, {"name": "lat", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "lng", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^addr_len", "^cat_servicecategory", "^desc_len", "^lat", "^lng", "^unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast_2", "op": "Cast", "input": ["addr_len", "^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "op": "Cast", "input": ["cat_servicecategory", "^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"SrcT": {"type": "DT_INT8"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast_1", "op": "Cast", "input": ["desc_len", "^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"SrcT": {"type": "DT_INT64"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/input_control_node/_8"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/stack", "op": "Pack", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast_2", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/PartitionedCall/Cast_1", "lat", "lng"], "attr": {"N": {"i": "5"}, "axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/stack", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "1"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/inference_op"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "1406", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzMwOWY5YTQzLTFiZDAtNDE3NC05YzVhLTFlMDFmNWI3ZGU5Ml9sb2FkXzEwMDc="}, "_has_manual_control_dependencies": {"b": true}, "container": {"s": ""}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^1406", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["1406", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"replace_global": {"b": true}, "rewrite": {"s": ""}, "pattern": {"s": "M2ZiMTE1NzYwMzNkNDBkY2RvbmU="}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"_has_manual_control_dependencies": {"b": true}, "file_prefix": {"s": "M2ZiMTE1NzYwMzNkNDBkYw=="}, "output_types": {"list": {}}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1994}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 1251}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/random_forest_model_1/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "1406", "shape": [], "dtype": "string"}]}]}